{
  "api": "Application Programming Interface (API) is a set of rules and protocols that allow different software applications to communicate and interact with each other.",
  "html": "Hypertext Markup Language (HTML) is the standard markup language used to create and structure content on the World Wide Web.",
  "css": "Cascading Style Sheets (CSS) is a style sheet language used for describing the presentation of a document written in HTML or XML.",
  "http": "Hypertext Transfer Protocol (HTTP) is an application protocol used for data communication on the web, often used for accessing web pages.",
  "iot": "Internet of Things (IoT) refers to the network of physical devices, vehicles, appliances, and other objects embedded with sensors and software that enables them to connect and exchange data over the internet.",
  "ml": "Machine Learning (ML) is a subset of artificial intelligence that provides systems the ability to learn and improve from experience without being explicitly programmed.",
  "vpn": "Virtual Private Network (VPN) is a secure and private connection established over a public network, allowing users to access the internet securely and anonymously.",
  "git": "Git is a distributed version control system used to track changes in source code during software development.",
  "dns": "Domain Name System (DNS) is a decentralized naming system for computers, services, or other resources connected to the internet or a private network.",
  "json": "JavaScript Object Notation (JSON) is a lightweight data-interchange format used to transmit data between a server and a web application, and as an alternative to XML.",
  "ssl": "Secure Sockets Layer (SSL) is a cryptographic protocol that provides secure communication over a computer network, commonly used to secure data transmission on the internet.",
  "rest": "Representational State Transfer (REST) is an architectural style for designing networked applications, especially web services, making them scalable, reliable, and stateless.",
  "oauth": "OAuth is an open standard for access delegation, commonly used as a way for internet users to grant websites or applications access to their information on other websites, without giving them their passwords.",
  "sql": "Structured Query Language (SQL) is a domain-specific language used for managing and manipulating relational databases.",
  "api_gateway": "API Gateway is a server that acts as an intermediary between an application and a collection of microservices, providing a unified interface to access various services.",
  "docker": "Docker is a platform that enables developers to automate the deployment of applications inside lightweight, portable containers, ensuring consistency across different environments.",
  "agile": "Agile is an iterative approach to software development, emphasizing collaboration, flexibility, and customer feedback to deliver high-quality products.",
  "devops": "DevOps is a set of practices that combines software development (Dev) and IT operations (Ops) to shorten the systems development life cycle and provide continuous delivery with high software quality.",
  "sso": "Single Sign-On (SSO) is an authentication process that allows users to log in with a single set of credentials (such as username and password) to access multiple applications or services.",
  "cdn": "Content Delivery Network (CDN) is a geographically distributed network of servers that work together to provide fast delivery of internet content, including web pages, images, videos, and other resources.",
  "dnssec": "Domain Name System Security Extensions (DNSSEC) is a suite of extensions that add a layer of security to the Domain Name System, ensuring data integrity and authentication of DNS data.",
  "big_data": "Big Data refers to large and complex datasets that require specialized processing and analysis techniques to reveal patterns, trends, and associations, often beyond the capabilities of traditional data processing applications.",
  "ai": "Artificial Intelligence (AI) is the simulation of human intelligence processes by machines, including learning, reasoning, and self-correction.",
  "sprint": "In the context of Agile development, a Sprint is a time-boxed period (usually 1-4 weeks) during which a set of specific tasks or user stories is completed and ready for review.",
  "websocket": "WebSocket is a communication protocol providing full-duplex communication channels over a single TCP connection, allowing bidirectional real-time communication between a client and a server.",
  "virtualization": "Virtualization is the process of creating a virtual (rather than actual) version of something, such as an operating system, a server, a storage device, or network resources.",
  "blockchain": "Blockchain is a decentralized, distributed ledger technology that records transactions across multiple computers, providing transparency, security, and immutability.",
  "microservices": "Microservices is an architectural style that structures an application as a collection of loosely coupled services, each focused on a specific business capability and independently deployable.",
  "scalability": "Scalability refers to the ability of a system to handle growing amounts of work, or its potential to be enlarged to accommodate that growth.",
  "python": "Python is a popular high-level programming language known for its simplicity, readability, and versatility, used in various domains such as web development, data analysis, machine learning, and automation."
}
